app/controllers/images_controller.rb

INSERT INTO "images" ("image_file", "created_at", "updated_at") VALUES (?, ?, ?)  [["image_file", "429589_334164259953078_1964443747_n.jpg"], ["created_at", "2015-09-24 05:56:52.829570"], ["updated_at", "2015-09-24 05:56:52.829570"]]
---
  def create
    @images = []
    #@image = Image.new(image_params)
    params[:files].each do |image_file|
      @images << Image.create(image_file: image_file)

DELETE FROM "images" WHERE "images"."id" = ?  [["id", 1]]
---
  def destroy
    @image.destroy

SELECT  "images".* FROM "images" WHERE "images"."id" = 4  ORDER BY "images"."id" ASC LIMIT 1
---
    def set_image
      @image = Image.find(params[:id])